In [1]:
import pandas as pd

df = pd.DataFrame({
    'Name': ['John', 'Mary', 'Steve', 'Mary', 'Steve', 'John'],
    'Age': [28, 32, 40, 27, 35, 31],
    'City': ['New York', 'Shanghai', 'London', 'New York', 'Shanghai', 'Tokyo']
})

In [2]:
df

    Name  Age      City
0   John   28  New York
1   Mary   32  Shanghai
2  Steve   40    London
3   Mary   27  New York
4  Steve   35  Shanghai
5   John   31     Tokyo

In [3]:
df.groupby('Name')['Age'].mean()

Name
John     29.5
Mary     29.5
Steve    37.5
Name: Age, dtype: float64

In [4]:
df.groupby('Name')['Age'].sum()

Name
John     59
Mary     59
Steve    75
Name: Age, dtype: int64

In [19]:
df.groupby('Name')['Age'].mean().reset_index().Name.str.upper()

0     JOHN
1     MARY
2    STEVE
Name: Name, dtype: object

In [20]:
import pandas as pd

data = {'Name': ['John', 'Mary', 'Steve', 'Mary', 'Steve', 'John'], 
        'Age': [28, 32, 40, 27, 35, 31],
        'City': ['New York', 'Shanghai', 'London', 'New York', 'Shanghai', 'Tokyo']}

df = pd.DataFrame(data)

In [21]:
df

    Name  Age      City
0   John   28  New York
1   Mary   32  Shanghai
2  Steve   40    London
3   Mary   27  New York
4  Steve   35  Shanghai
5   John   31     Tokyo

In [ ]:
# What would df.groupby('City')['Age'].mean() return?

# For the same DataFrame above, what would df.groupby(['Name', 'City'])['Age'].count() return?
# Create a DataFrame with 3 columns: Name, Product, and Price. Include 5 rows of sample data. Then group by Product and calculate the total price for each product.
# For the DataFrame you created in #3, group by both Name and Product to calculate the total price for each product bought by each person.
# For the DataFrame in #3, group by Product and rename the counted column from the default to 'NumPurchases'.

In [23]:
df.groupby('City')['Age'].mean()

City
London      40.0
New York    27.5
Shanghai    33.5
Tokyo       31.0
Name: Age, dtype: float64

In [24]:
df.groupby(['Name', 'City'])['Age'].count()

Name   City
John   New York    1
       Tokyo       1
Mary   New York    1
       Shanghai    1
Steve  London      1
       Shanghai    1
Name: Age, dtype: int64

In [25]:
df

    Name  Age      City
0   John   28  New York
1   Mary   32  Shanghai
2  Steve   40    London
3   Mary   27  New York
4  Steve   35  Shanghai
5   John   31     Tokyo

In [28]:
# Create a DataFrame with 3 columns: Name, Product, and Price.
# Include 5 rows of sample data.
# Then group by Product and calculate the total price for each product.
# import pandas as pd

data = {'Name': ['John', 'Mary', 'Steve', 'Mary', 'John'],
        'Product': ['Phone', 'Laptop', 'Headphones', 'Webcam', 'Headphones'], 
        'Price': [700, 1200, 100, 50, 100]
       }

df = pd.DataFrame(data)

df

    Name     Product  Price
0   John       Phone    700
1   Mary      Laptop   1200
2  Steve  Headphones    100
3   Mary      Webcam     50
4   John  Headphones    100

In [33]:
df.groupby('Product')['Price'].sum().reset_index()

      Product  Price
0  Headphones    200
1      Laptop   1200
2       Phone    700
3      Webcam     50

In [38]:
df.groupby(['Name', 'Product'])['Price'].sum()

Name   Product
John   Headphones     100
       Phone          700
Mary   Laptop        1200
       Webcam          50
Steve  Headphones     100
Name: Price, dtype: int64

In [40]:
df.groupby(['Name'])['Price'].sum().reset_index()

    Name  Price
0   John    800
1   Mary   1250
2  Steve    100

In [43]:
df.groupby(['Product'])['Price'].count().reset_index()

      Product  Price
0  Headphones      2
1      Laptop      1
2       Phone      1
3      Webcam      1

In [46]:
df.groupby(['Product'])['Price'].count().rename('NumPurchases').reset_index()

      Product  NumPurchases
0  Headphones             2
1      Laptop             1
2       Phone             1
3      Webcam             1

In [48]:
import pandas as pd

data = {'Store': ['A', 'A', 'B', 'B', 'C', 'C'],
        'Product': ['Apple', 'Orange', 'Apple', 'Banana', 'Orange', 'Banana'], 
        'Revenue': [1200, 500, 700, 400, 800, 900]}

df = pd.DataFrame(data)

df

  Store Product  Revenue
0     A   Apple     1200
1     A  Orange      500
2     B   Apple      700
3     B  Banana      400
4     C  Orange      800
5     C  Banana      900

In [ ]:
For the DataFrame below, groupby 'Name' and 'City' and count the number of occurrences.

In [49]:
df

  Store Product  Revenue
0     A   Apple     1200
1     A  Orange      500
2     B   Apple      700
3     B  Banana      400
4     C  Orange      800
5     C  Banana      900

In [54]:
df.groupby('Product')['Revenue'].sum().rename('sum_of_revenue').reset_index()

  Product  sum_of_revenue
0   Apple            1900
1  Banana            1300
2  Orange            1300

In [ ]:
What is the average revenue per product?
What is the highest revenue per store?
What is the lowest revenue per product?
How many unique products does each store sell?

In [57]:
df.groupby('Product')['Revenue'].mean().rename('revenue_mean_by_product').reset_index()

  Product  revenue_mean_by_product
0   Apple                    950.0
1  Banana                    650.0
2  Orange                    650.0

In [59]:
df.groupby('Product')['Revenue'].min().rename('revenue_LOWEST_by_product').reset_index()

  Product  revenue_LOWEST_by_product
0   Apple                        700
1  Banana                        400
2  Orange                        500

In [60]:
df

  Store Product  Revenue
0     A   Apple     1200
1     A  Orange      500
2     B   Apple      700
3     B  Banana      400
4     C  Orange      800
5     C  Banana      900

In [ ]:
How many unique products does each store sell?

In [61]:
df.groupby('Store')['Product'].nunique()

Store
A    2
B    2
C    2
Name: Product, dtype: int64

In [64]:
df.groupby('Store')['Revenue'].agg(['sum', 'mean', 'max', 'min', 'count']).reset_index()

  Store   sum   mean   max  min  count
0     A  1700  850.0  1200  500      2
1     B  1100  550.0   700  400      2
2     C  1700  850.0   900  800      2

In [65]:
df.groupby('Store').agg({'Revenue': ['sum', 'mean'], 'Product': 'count'}).reset_index()

  Store Revenue        Product
            sum   mean   count
0     A    1700  850.0       2
1     B    1100  550.0       2
2     C    1700  850.0       2

In [66]:
df.groupby('Store')['Revenue'].sum()
df.groupby(['Store', 'Product'])['Revenue'].sum()
df.groupby('Store')['Revenue'].agg(['sum', 'mean', 'max', 'min', 'count'])
df.groupby('Store').agg({'Revenue': ['sum', 'mean'], 'Product': 'count'})
df.groupby('Store')['Revenue'].apply(lambda x: (x - x.mean()) / x.std())
df.groupby('Store').filter(lambda x: x['Revenue'].sum() > 1000)
df.groupby('Store')['Revenue'].transform(lambda x: (x - x.mean()) / x.std())
df.pivot_table(values='Revenue', index='Store', columns='Product', aggfunc='sum')
for name, group in df.groupby('Store'):
    print(name)
    print(group)

A
  Store Product  Revenue
0     A   Apple     1200
1     A  Orange      500
B
  Store Product  Revenue
2     B   Apple      700
3     B  Banana      400
C
  Store Product  Revenue
4     C  Orange      800
5     C  Banana      900